#pragma region Мушки:
{ L"*", L"*и", прид, { муш, једн, ном }, оснпоз },
{ L"*", L"*ог", прид,{ муш, једн, ген }, оснпоз },
{ L"*", L"*ога", прид,{ муш, једн, ген, д_о }, оснпоз },
{ L"*", L"*ом", прид,{ муш, једн, дат }, оснпоз },
{ L"*", L"*оме", прид,{ муш, једн, дат, д_о }, оснпоз },
{ L"*", L"*", прид,{ муш, једн, акуз }, оснпоз },
{ L"*", L"*и", прид,{ муш, једн, вок }, оснпоз },
{ L"*", L"*им", прид,{ муш, једн, инстр }, оснпоз },
{ L"*", L"*ом", прид,{ муш, једн, лок }, оснпоз },
{ L"*", L"*оме", прид,{ муш, једн, лок, д_о }, оснпоз },

{ L"*", L"*и", прид,{ муш, множ, ном }, оснпоз },
{ L"*", L"*их", прид,{ муш, множ, ген }, оснпоз },
{ L"*", L"*им", прид,{ муш, множ, дат }, оснпоз },
{ L"*", L"*е", прид,{ муш, множ, акуз }, оснпоз },
{ L"*", L"*и", прид,{ муш, множ, вок }, оснпоз },
{ L"*", L"*им", прид,{ муш, множ, инстр }, оснпоз },
{ L"*", L"*им", прид,{ муш, множ, лок }, оснпоз },
#pragma endregion

#pragma region Женски:
{ L"*", L"*а", прид,{ жен, једн, ном }, оснпоз },
{ L"*", L"*е", прид,{ жен, једн, ген }, оснпоз },
{ L"*", L"*ој", прид,{ жен, једн, дат }, оснпоз },
{ L"*", L"*у", прид,{ жен, једн, акуз }, оснпоз },
{ L"*", L"*а", прид,{ жен, једн, вок }, оснпоз },
{ L"*", L"*ом", прид,{ жен, једн, инстр }, оснпоз },
{ L"*", L"*ој", прид,{ жен, једн, лок }, оснпоз },

{ L"*", L"*е", прид,{ жен, множ, ном }, оснпоз },
{ L"*", L"*их", прид,{ жен, множ, ген }, оснпоз },
{ L"*", L"*им", прид,{ жен, множ, дат }, оснпоз },
{ L"*", L"*е", прид,{ жен, множ, акуз }, оснпоз },
{ L"*", L"*е", прид,{ жен, множ, вок }, оснпоз },
{ L"*", L"*им", прид,{ жен, множ, инстр }, оснпоз },
{ L"*", L"*им", прид,{ жен, множ, лок }, оснпоз },
#pragma endregion

#pragma region Средњи:
{ L"*", L"*о", прид,{ сред, једн, ном }, оснпоз },
{ L"*", L"*ог", прид,{ сред, једн, ген }, оснпоз },
{ L"*", L"*ога", прид,{ сред, једн, ген, д_о }, оснпоз },
{ L"*", L"*ом", прид,{ сред, једн, дат }, оснпоз },
{ L"*", L"*оме", прид,{ сред, једн, дат, д_о }, оснпоз },
{ L"*", L"*о", прид,{ сред, једн, акуз }, оснпоз },
{ L"*", L"*о", прид,{ сред, једн, вок }, оснпоз },
{ L"*", L"*им", прид,{ сред, једн, инстр }, оснпоз },
{ L"*", L"*ом", прид,{ сред, једн, лок }, оснпоз },
{ L"*", L"*оме", прид,{ сред, једн, лок, д_о }, оснпоз },

{ L"*", L"*и", прид,{ сред, множ, ном }, оснпоз },
{ L"*", L"*их", прид,{ сред, множ, ген }, оснпоз },
{ L"*", L"*им", прид,{ сред, множ, дат }, оснпоз },
{ L"*", L"*е", прид,{ сред, множ, акуз }, оснпоз },
{ L"*", L"*и", прид,{ сред, множ, вок }, оснпоз },
{ L"*", L"*има", прид,{ сред, множ, инстр }, оснпоз },
{ L"*", L"*има", прид,{ сред, множ, лок }, оснпоз },
#pragma endregion