#pragma region Заменице
{ L"ја", зам, { лиц1, једн },
{
	{ L"ја",{ ном } },
	{ L"мене",{ ген } },
	{ L"мени",{ дат } },
	{ L"мене",{ акуз } }
} },
{ L"ти", зам,{ лиц2 },
{
	{ L"ти",{ ном } },
	{ L"тебе",{ ген } },
	{ L"теби",{ дат } },
	{ L"тебе",{ акуз } },
} },
{ L"он", зам,{ лиц3, једн, муш },
{
	{ L"он",{ ном } },
	{ L"њега",{ ген } },
	{ L"њему",{ дат } },
	{ L"њега",{ акуз } },
} },
{ L"она", зам,{ лиц3, једн, жен },
{
	{ L"она",{ ном } },
	{ L"ње",{ ген } },
	{ L"њој",{ дат } },
	{ L"њу",{ акуз } },
} },
{ L"оно", зам,{ лиц3, једн, сред },
{
	{ L"он",{ ном } },
	{ L"њега",{ ген } },
	{ L"њему",{ дат } },
	{ L"њега",{ акуз } },
} },
#pragma endregion

// Глаголи:
{ L"волети", глаг,{} },
{ L"гледати", глаг,{} },
{ L"ићи",	глаг,{} },
{ L"певати", глаг,{} },
{ L"радити", глаг,{} },

	// Именице:
{ L"жена", имен,{ жен } },
{ L"кућа", имен,{ жен } },
{ L"мачка", имен,{ жен } },
{ L"стена", имен,{ жен } },
{ L"ташна", имен,{ жен } },
{ L"школа", имен,{ жен } },

	// Придеви:
{ L"глуп", прид },
{ L"леп", прид },
{ L"плав", прид },

	// Прилози:
{ L"добро", прил },
{ L"лепо", прил },
{ L"брзо", прил },